import pandas as pd
import numpy as np

title = ["序号", "所用时间", "1.您所属的年级是？", "2.您的性别", "3.您平时是否玩网络游戏", "4.请问您平时玩什么类型的网络游戏？", "5.您一周内玩网络游戏的频率一般是", "6.您平均每天玩多少个小时网络游戏", "7.您在近一个月以来玩游戏最晚的时间为：", "8.您平均每个月在网络游戏中花费多少钱", "9.您玩网络游戏的目的是什么", "10.如果玩网络游戏的时间和学习冲突，您会", "11.您在游玩网络游戏时的状态，下列哪些描述和您符合？", "12.您认为网络游戏给您带来了什么？", "13.您是否认为网络游戏已经成为您生活中不可或缺的一部分？", "14.您是否会因为游玩游戏而熬夜？", "15.您是否会因为玩游戏而耽误吃饭？", "16.您的学习习惯和下列哪种描述最为符合？", "17.您一周的锻炼频次大约在？", "18.您在临近期末考试时，以下哪种描述和您最为相符？"]
title_quan = ["序号", "所用时间", "1.您所属的年级是？", "2.您的性别", "3.您平时是否玩网络游戏", "5.您一周内玩网络游戏的频率一般是", "6.您平均每天玩多少个小时网络游戏", "7.您在近一个月以来玩游戏最晚的时间为：", "8.您平均每个月在网络游戏中花费多少钱", "10.如果玩网络游戏的时间和学习冲突，您会", "13.您是否认为网络游戏已经成为您生活中不可或缺的一部分？", "14.您是否会因为游玩游戏而熬夜？", "15.您是否会因为玩游戏而耽误吃饭？", "16.您的学习习惯和下列哪种描述最为符合？", "17.您一周的锻炼频次大约在？", "18.您在临近期末考试时，以下哪种描述和您最为相符？"]
src = "编造数据的定性分析 （剔除问卷后）.xlsx"

mappingResult = [dict() for _ in range(21)]
def updDict(idx, val):
    if mappingResult[idx].get(val) is None:
        mappingResult[idx][val] = 1
    else:
        mappingResult[idx][val] += 1

df = pd.read_excel(src)
for row in range(len(df)):
    for col in df.columns:
        lst = col.split(".")
        if df[col][row] == "(跳过)":
            break
        if len(lst) > 1:
            index = int(lst[0])
            val = df[col][row]
            val = val.split("┋")
            for i in val:
                updDict(index, i)

for i in mappingResult:     # 总体统计
    if len(i) == 0:
        continue
    print(i)
    
ans = {'放松和消遣': 49, '不良的生活习性': 12, '身心放松': 16, '展现优于他人的个人游戏操作技术': 12, '等级、称号或积分就要比别 人高': 7, '通过游戏结交了更多朋友': 9, '现实中没有的快乐': 14}
for k, v in ans.items():
    print(k)
for k, v in ans.items():
    print(v)